{
  "metadata": {
    "page_id": "17386855",
    "title": "RACI",
    "space_key": "CIPPMOPF",
    "version": 8,
    "last_modified": "2026-01-26T17:03:15.568Z",
    "url": "https://eaton-corp.atlassian.net/wiki/wiki/spaces/CIPPMOPF/pages/17386855",
    "extracted_at": "2026-01-26T17:05:27.623364Z",
    "total_blocks": 5,
    "total_images": 2,
    "attachment_images": 1,
    "external_images": 1,
    "attachments_count": 1,
    "images_described": true,
    "description_tokens_used": 2529,
    "uploaded_to_blob": true,
    "blob_container_media": "confluence-media",
    "blob_container_rag": "confluence-rag",
    "media_base_path": "CIPPMOPF/17386855/v8"
  },
  "content_blocks": [
    {
      "type": "heading",
      "level": 2,
      "content": "Definition of RACI",
      "index": 0
    },
    {
      "type": "text",
      "content": "RACI is an acronym representing different roles in task completion. While there are various versions of this model, the key is to clearly define each role. Here&rsquo;s what each letter stands for:",
      "index": 1
    },
    {
      "type": "list",
      "list_type": "unordered",
      "items": [
        "R = Responsible : This is the task lead &ndash; the person ultimately responsible for completing the job. There should be only one Responsible person, though others can assist with the work.",
        "A = Accountable : Also known as the approver or final approving authority, this person is answerable for the task&rsquo;s correct and thorough completion. They ensure prerequisites are met and delegate work to the Responsible person. The Accountable person must sign off on the work provided by the Responsible person. There should be only one Accountable person per task or deliverable. This role can be filled by the Responsible person, a technical expert, or a stakeholder.",
        "C = Consulted : These individuals offer advice or guidance but do not actively work on the task. They are often subject matter experts who provide input or technical reviews.",
        "I = Informed : These are the people kept up-to-date on progress, usually upon task or deliverable completion. Communication with them is one-way."
      ],
      "index": 2
    },
    {
      "type": "image",
      "source": "external_url",
      "filename": "SDLC.jpg",
      "external_url": "https://media.geeksforgeeks.org/wp-content/uploads/20231220113035/SDLC.jpg",
      "alt_text": "Software Development Life Cycle (SDLC) - GeeksforGeeks",
      "width": 660,
      "height": 330,
      "index": 3,
      "local_path": "images\\003_SDLC.jpg",
      "file_size": 15692,
      "media_type": "image/jpeg",
      "description": "This image represents the **Software Development Life Cycle (SDLC)**, a systematic process for planning, creating, testing, and deploying software. It does not contain a table or matrix but instead illustrates the stages of the SDLC in a circular flow diagram.\n\n### 1. **Table Title/Purpose**:\n   - The purpose of this diagram is to outline the stages of the Software Development Life Cycle (SDLC).\n\n### 2. **Column Headers**:\n   - Not applicable, as this is not a table.\n\n### 3. **Row Headers**:\n   - Not applicable, as this is not a table.\n\n### 4. **Data Content**:\n   - The diagram shows six stages of the SDLC arranged in a circular flow:\n     1. **Planning**: The initial phase where goals, scope, and feasibility are determined.\n     2. **Defining**: Requirements are gathered and documented.\n     3. **Designing**: The architecture and design of the software are created.\n     4. **Building**: The actual development and coding of the software take place.\n     5. **Testing**: The software is tested for bugs and issues.\n     6. **Deployment**: The software is deployed to production and made available to users.\n\n### 5. **Legend/Key**:\n   - Not applicable, as no legend is present.\n\n### 6. **Key Insights**:\n   - The SDLC is a structured approach to software development.\n   - Each stage is interconnected, forming a continuous cycle.\n   - The process ensures that software is developed systematically, reducing risks and improving quality.\n\n### 7. **Notable Cells**:\n   - Not applicable, as this is not a table.\n\n### Additional Notes:\n   - This diagram does not represent a RACI matrix or responsibility assignment matrix. It is a conceptual representation of the stages in the SDLC process.",
      "description_type": "table",
      "blob_url": "https://cipdigest.blob.core.windows.net/confluence-media/CIPPMOPF/17386855/v8/003_SDLC.jpg"
    },
    {
      "type": "image",
      "source": "attachment",
      "filename": "image-20260126-170300.png",
      "alt_text": "image-20260126-170300.png",
      "width": 631,
      "height": null,
      "index": 4,
      "local_path": "images\\004_image-20260126-170300.png",
      "media_type": "image/png",
      "file_size": 249740,
      "description": "### Comprehensive Analysis of the Image:\n\n#### 1. **Image Type**:\n   - This is a **screenshot** of a graphical user interface (GUI) from a software application, likely related to monitoring and managing an Uninterruptible Power Supply (UPS) system.\n\n#### 2. **Main Content**:\n   - The image displays a **UPS monitoring software interface**. It includes various visual and textual elements to provide real-time information about the UPS system's status, voltage levels, battery runtime, load percentage, and other relevant metrics.\n\n#### 3. **Text Content**:\n   - The image includes the following visible text:\n     - **Toolbar buttons**: \"Quick-launch most common tasks.\"\n     - **Input voltage meter**: \"Input Voltage\" and \"120 VAC.\"\n     - **Battery runtime**: \"Amount of time the UPS can operate on battery power.\"\n     - **Active events log**: \"Active Events Log\" and \"12/31/2020 08:14 PM - There are no active alarms or warnings.\"\n     - **LanSafe controller name, location, and UPS model**: \"Controller: mserver (10.2021.10.10)\" and \"UPS model: Powerware 9125.\"\n     - **Animated UPS topology display**: \"UPS Status.\"\n     - **Output voltage meter**: \"Output Voltage\" and \"120 VAC.\"\n     - **Load percent**: \"Percent of maximum output load the UPS supports; the number increases when new devices are plugged into the UPS.\"\n     - **ABM® technology**: \"Exclusive three-stage charging technique that significantly extends battery life.\"\n\n#### 4. **Visual Elements**:\n   - **Layout**:\n     - The interface is divided into multiple sections, each providing specific information.\n   - **Meters**:\n     - Two vertical bar meters on the left and right represent **Input Voltage** and **Output Voltage**, both labeled \"120 VAC.\"\n   - **Central Display**:\n     - An animated topology diagram shows the UPS system's structure, including icons for the UPS, battery, and connected devices.\n   - **Events Log**:\n     - A text box at the bottom displays event logs and system messages.\n   - **Toolbar**:\n     - A row of icons at the top provides quick access to common tasks.\n   - **Colors**:\n     - Predominantly blue background with white, red, green, and gray elements for contrast and emphasis.\n   - **Labels and Annotations**:\n     - Pink arrows and labels explain the purpose of each section.\n\n#### 5. **Data/Information**:\n   - **Input Voltage**: 120 VAC.\n   - **Output Voltage**: 120 VAC.\n   - **Battery Runtime**: Not explicitly stated but referenced as a key metric.\n   - **Load Percent**: Indicates the percentage of maximum load the UPS supports.\n   - **Event Log**: No active alarms or warnings as of the timestamp \"12/31/2020 08:14 PM.\"\n\n#### 6. **Context**:\n   - This image serves as a **visual guide or tutorial** for understanding the features and interface of a UPS monitoring software. It is likely part of a user manual, training material, or product documentation for a UPS system.\n\n#### 7. **Key Details**:\n   - **Purpose**: The software interface is designed to monitor and manage the UPS system, ensuring optimal performance and providing alerts for any issues.\n   - **Annotations**: Pink arrows and labels help users understand the interface's key components.\n   - **ABM® Technology**: Highlights a unique feature of the UPS system, emphasizing extended battery life.\n   - **Real-Time Metrics**: The interface provides live updates on voltage, load, and system status.\n   - **Event Log**: Tracks and displays system events, ensuring users are informed about any issues or changes.\n\nThis image is a detailed representation of a UPS monitoring system's interface, designed for technical users to manage and monitor their power systems effectively.",
      "description_type": "general",
      "blob_url": "https://cipdigest.blob.core.windows.net/confluence-media/CIPPMOPF/17386855/v8/004_image-20260126-170300.png"
    }
  ],
  "attachments": [
    {
      "id": "att1335689259",
      "title": "image-20260126-170300.png",
      "media_type": "image/png",
      "file_size": 249740,
      "download_link": "/download/attachments/17386855/image-20260126-170300.png?version=1&modificationDate=1769446982464&cacheVersion=1&api=v2"
    }
  ],
  "raw_html_length": 2456
}